Ran Plan for 8 projects:

1. dir: `infra/us-east-1/dev/rds/security-group` workspace: `default`
1. dir: `infra/us-east-1/dev/eks/cluster` workspace: `default`
1. dir: `infra/us-east-1/dev/eks/honeycomb` workspace: `default`
1. dir: `infra/us-east-1/dev/vpc` workspace: `default`
1. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `default`
1. dir: `infra/us-east-1/dev/eks/cluster-addons` workspace: `default`
1. dir: `infra/us-east-1/mgmt/peering/dev` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `default`

### 1. dir: `infra/us-east-1/dev/rds/security-group` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/rds/security-group`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Frds%252Fsecurity-group%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/rds/security-group`

---
### 2. dir: `infra/us-east-1/dev/eks/cluster` workspace: `default`
<details><summary>Show Output</summary>

```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
╷
│ Warning: Argument is deprecated
│ 
│   with module.eks.aws_eks_addon.this["kube-proxy"],
│   on .terraform/modules/eks/main.tf line 392, in resource "aws_eks_addon" "this":
│  392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│ 
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
│ 
│ (and 2 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fcluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/cluster`
</details>
No changes. Your infrastructure matches the configuration.

---
### 3. dir: `infra/us-east-1/dev/eks/honeycomb` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/honeycomb`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fhoneycomb%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/honeycomb`

---
### 4. dir: `infra/us-east-1/dev/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route_table.database[0] will be created
+   resource "aws_route_table" "database" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "scde-dev-us-east-1-db"
        }
+       tags_all         = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-db"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id           = "vpc-07838bb868f5b4c8c"
    }

  # aws_route_table_association.database[0] will be updated in-place
!   resource "aws_route_table_association" "database" {
        id             = "rtbassoc-023411dbc546a4c18"
!       route_table_id = "rtb-0303dbb2e0e8365ce" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.database[1] will be updated in-place
!   resource "aws_route_table_association" "database" {
        id             = "rtbassoc-0021364c83f70699b"
!       route_table_id = "rtb-0303dbb2e0e8365ce" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.database[2] will be updated in-place
!   resource "aws_route_table_association" "database" {
        id             = "rtbassoc-02a4c5f2a629e5f7b"
!       route_table_id = "rtb-0303dbb2e0e8365ce" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

Changes to Outputs:
!   database_route_table_ids                    = [
-       "rtb-0303dbb2e0e8365ce",
+       (known after apply),
    ]
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/vpc`
</details>
Plan: 1 to add, 3 to change, 0 to destroy.

---
### 5. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/kubevela-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fkubevela-addons%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/kubevela-addons`

---
### 6. dir: `infra/us-east-1/dev/eks/cluster-addons` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/cluster-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fcluster-addons%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/cluster-addons`

---
### 7. dir: `infra/us-east-1/mgmt/peering/dev` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/peering/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fpeering%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/peering/dev`

---
### 8. dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.gh-oauth[0] will be created
+   resource "kubectl_manifest" "gh-oauth" {
+       api_version             = "v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Secret"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "gh-oauth"
+       namespace               = "marlowe"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: gh-oauth
              namespace: marlowe
        EOT
+       yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.iohk-ghcr-creds[0] will be created
+   resource "kubectl_manifest" "iohk-ghcr-creds" {
+       api_version             = "v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Secret"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "iohk-ghcr-creds"
+       namespace               = "marlowe"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: iohk-ghcr-creds
              namespace: marlowe
        EOT
+       yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.jwt-signature[0] will be created
+   resource "kubectl_manifest" "jwt-signature" {
+       api_version             = "v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Secret"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "jwt-signature"
+       namespace               = "marlowe"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: jwt-signature
              namespace: marlowe
        EOT
+       yaml_incluster          = (sensitive value)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/eks/green/kubevela-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Feks%252Fgreen%252Fkubevela-addons%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/eks/green/kubevela-addons`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`